poc1/result/k6-80rps-new.txt
tadanoyousei@TYMM4 k6 % k6 run combined.js

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: combined.js
        output: -

     scenarios: (100.00%) 1 scenario, 2000 max VUs, 3m5s max duration (incl. graceful stop):
              * pointcloud_upload: 80.00 iterations/s for 3m0s (maxVUs: 50-2000, exec: uploadScenario, gracefulStop: 5s)

WARN[0027] Request Failed                                error="Post \"http://localhost:8002/upload/prepare\": EOF"
WARN[0029] Request Failed                                error="Post \"http://localhost:8002/upload/prepare\": EOF"
WARN[0057] Request Failed                                error="Post \"http://localhost:8002/upload/prepare\": EOF"
WARN[0057] Request Failed                                error="Post \"http://localhost:8002/upload/prepare\": EOF"
WARN[0058] Request Failed                                error="Post \"http://localhost:8002/upload/prepare\": EOF"
WARN[0080] Request Failed                                error="Post \"http://localhost:8000/upload/prepare\": EOF"
WARN[0080] Request Failed                                error="Post \"http://localhost:8000/upload/prepare\": EOF"
WARN[0095] Request Failed                                error="Post \"http://localhost:8001/upload/prepare\": EOF"
WARN[0095] Request Failed                                error="Post \"http://localhost:8001/upload/prepare\": EOF"
WARN[0096] Request Failed                                error="Put \"http://localhost:9002/edge2-point-cloud/tmp/xn1vqhzy/88939e20c1b08c10/x%2B34-70011159734301-y%2B137-73557007483018-8.ply\": EOF"
WARN[0100] Request Failed                                error="Post \"http://localhost:8001/upload/prepare\": EOF"
WARN[0101] Request Failed                                error="Post \"http://localhost:8001/upload/prepare\": EOF"
WARN[0101] Request Failed                                error="Post \"http://localhost:8001/upload/prepare\": EOF"
WARN[0101] Request Failed                                error="Post \"http://localhost:8001/upload/prepare\": EOF"
WARN[0102] Request Failed                                error="Post \"http://localhost:8001/upload/prepare\": EOF"
WARN[0107] Request Failed                                error="Post \"http://localhost:8000/upload/prepare\": EOF"
WARN[0114] Request Failed                                error="Post \"http://localhost:8002/upload/prepare\": EOF"
WARN[0115] Request Failed                                error="Put \"http://localhost:9004/edge3-point-cloud/tmp/xn1vqhzy/3a3cfb4626313a68/x%2B34-70011159734301-y%2B137-73557007483018-8.ply\": EOF"
WARN[0120] Request Failed                                error="Post \"http://localhost:8002/upload/prepare\": EOF"
WARN[0123] Request Failed                                error="Post \"http://localhost:8001/upload/prepare\": EOF"
WARN[0123] Request Failed                                error="Post \"http://localhost:8001/upload/prepare\": EOF"
WARN[0124] Request Failed                                error="Post \"http://localhost:8001/upload/prepare\": EOF"
WARN[0127] Request Failed                                error="Post \"http://localhost:8002/upload/prepare\": EOF"
WARN[0130] Request Failed                                error="Post \"http://localhost:8002/upload/prepare\": EOF"
WARN[0133] Request Failed                                error="Post \"http://localhost:8002/upload/prepare\": EOF"
WARN[0133] Request Failed                                error="Post \"http://localhost:8002/upload/prepare\": EOF"
WARN[0133] Request Failed                                error="Post \"http://localhost:8002/upload/prepare\": EOF"
WARN[0136] Request Failed                                error="Post \"http://localhost:8001/upload/prepare\": EOF"
WARN[0136] Request Failed                                error="Post \"http://localhost:8002/upload/prepare\": EOF"
WARN[0136] Request Failed                                error="Post \"http://localhost:8002/upload/prepare\": EOF"
WARN[0149] Request Failed                                error="Post \"http://localhost:8002/upload/prepare\": EOF"
WARN[0149] Request Failed                                error="Post \"http://localhost:8002/upload/prepare\": EOF"
WARN[0149] Request Failed                                error="Post \"http://localhost:8002/upload/prepare\": EOF"


  █ TOTAL RESULTS 

    checks_total.......: 27715  149.806773/s
    checks_succeeded...: 99.87% 27681 out of 27715
    checks_failed......: 0.12%  34 out of 27715

    ✗ upload prepare succeeded
      ↳  99% — ✓ 13842 / ✗ 31
    ✗ point cloud upload succeeded
      ↳  99% — ✓ 13839 / ✗ 3

    HTTP
    http_req_duration..............: avg=978.57ms min=308µs    med=39.47ms  max=30.28s p(90)=3.45s p(95)=5.67s
      { expected_response:true }...: avg=978.31ms min=2.03ms   med=39.46ms  max=14.43s p(90)=3.46s p(95)=5.67s
    http_req_failed................: 0.12% 34 out of 27715
    http_reqs......................: 27715 149.806773/s

    EXECUTION
    dropped_iterations.............: 350   1.891841/s
    iteration_duration.............: avg=1.95s    min=542.41µs med=268.35ms max=39.78s p(90)=6.37s p(95)=8.6s 
    iterations.....................: 13873 74.987168/s
    vus............................: 178   min=1           max=386
    vus_max........................: 400   min=50          max=400

    NETWORK
    data_received..................: 13 MB 68 kB/s
    data_sent......................: 11 GB 57 MB/s



running (3m05.0s), 0000/0400 VUs, 13873 complete and 178 interrupted iterations
pointcloud_upload ✓ [======================================] 0178/0400 VUs  3m0s  80.00 iters/s